-- انشاء قاعدة البيانات للمدرسة
CREATE DATABASE SecondaryـEducationـExcellence; 

-- USE لاستخدام قاعدة البيانات نستخدم
USE SecondaryـEducationـExcellence;

-- **************************************************
-- انشاء جدول للمعلمين
CREATE TABLE Teachers(
Teacher_ID INT PRIMARY KEY,
Teacher_Name VARCHAR(100) NOT NULL,
Birth_Date DATE,
Gender VARCHAR(20),
Email VARCHAR(100) UNIQUE,
Office_Number VARCHAR(20)
);

-- انشاء جدول للمواد
CREATE TABLE Subjects(
Subject_ID INT PRIMARY KEY,
Subject_Name VARCHAR(100) NOT NULL
);

-- انشاء جدول للطلاب 
CREATE TABLE Students(
Student_ID INT PRIMARY KEY,
Student_Name VARCHAR(100) NOT NULL,
Birth_Date DATE,
Gender VARCHAR(20),
Enrollment_Date DATE,
Students_email VARCHAR(100)UNIQUE,
Academic_Level VARCHAR(50),
Track VARCHAR(50),
GPA DECIMAL(5,2) -- This is the standard choice for percentages.
);

-- **************************************************


-- إدخال معلومات 30 طالب
-- إضافة عدة أسطر من البيانات للجدول مرة واحدة
INSERT INTO SecondaryـEducationـExcellence.Students(Student_ID,Student_Name,Birth_Date,Gender,
Enrollment_Date,Students_email,Academic_Level,Track,GPA) VALUES
(1, "نورة محمد", '2009-07-10' , 'M',  '2026-01-09', "Noura@std.com", "1", "علمي", 98.45),
(2, "سعد الفهد", '2006-03-12' , 'M',  '2023-01-09', "saad@std.com", "4", "علمي", 91.30),
(3, "ليان حسن", '2008-11-04' , 'F', '2023-01-09', "layan@std.com","2", "علمي", 80.90),
(4,"عمر ياسين",'2005-03-06' , 'M', '2022-01-09', "omar@std.com","5", "انساني", 93.56),
(5,"جود خالد",'2007-03-12', 'F','2024-01-09', "joud@std.com","3", "انساني", 79.88),
(6, "أمل إبراهيم",'2005-04-03' , 'F', '2022-01-09' , "amal@std.com","5", "انساني", 89.63),
(7,"نايف فهد", '2006-12-11' , 'M','2023-01-09' , "naif@std.com","4", "علمي", 99.15),
(8,"بدر ناصر",  '2007-05-09', 'M','2024-01-09', "bader@std.com","3", "علمي", 84.98),
(9, "شوق محمد", '2006-07-03', 'F','2023-01-09'  , "shouq@std.com","4", "علمي", 77.58),
(10,"تركي عبدالله", '2005-10-10', 'M','2022-01-09' , "turki@std.com","5", "انساني", 93.00)
,(11,"فهد السويلم",'2006-08-18' , 'M','2023-01-09' , "fahad@std.com","4", "علمي", 83.10),
(12, "ميار صالح",'2007-12-25' , 'F','2023-01-09', "mayar@std.com","3", "انساني", 86.60),
(13,"سطام رائد",'2005-02-11' , 'M','2022-01-09', "sattam@std.com","5", "انساني", 91.44),
(14,"غادة علي",'2006-03-01' , 'M','2023-01-09', "ghada@std.com","4", "علمي", 94.14),
(15, "ديمة وليد",'2008-08-06', 'F','2025-01-09', "deema@std.com","2", "عام", 74.33),
(16,"مشعل نايف",'2008-06-28', 'M','2026-01-09', "meshal@std.com","1", "علمي", 71.23),
(17,"سلطان فواز",'2007-04-16', 'M','2024-01-09', "sultan@std.com","3", "انساني", 85.55),
(18, "تالا فيصل",'2008-02-23','F','2025-01-09', "tala@std.com","2", "انساني", 96.35),
(19,"رغد سلطان",'2009-08-22', 'F','2026-01-09', "raghad@std.com","1", "انساني", 92.96),
(20,"ياسر منير",'2005-01-30', 'M', '2022-01-09', "yasser@std.com","5", "علمي", 87.86),
(21, "لجين ماجد",'2007-11-01' ,'F','2024-01-09', "lujain@std.com","3", "انساني", 90.60),
(22,"ريان هاني", '2006-07-07', 'M', '2023-01-09', "rayan@std.com","4", "علمي", 75.99),
(23,"طلال سامي", '2007-11-01' , 'M','2024-01-09', "talal@std.com","3", "علمي", 80.03,
(24, "نوف مساعد",'2008-07-18', 'F','2025-01-09', "nouf@std.com","2", "علمي", 84.13),
(25, "وسن حمد",'2006-02-20', 'F','2023-01-09', "wasan@std.com","4", "انساني", 78.83),
(26,"عبدالله يوسف",'2008-09-11', 'M','2025-01-09', "abdullah@std.com","2", "انساني", 97.63),
(27, "جواهر فهد",'2008-09-11', 'F', '2025-01-09', "jawaher_1@std.com","2", "علمي", 93.51),
(28,"منصور حازم",'2006-04-27', 'M', '2023-01-09', "mansour@std.com","4", "علمي", 77.91),
(29,"سديم تركي", '2005-01-02', 'F','2022-01-09', "jawaher@std.com","5", "علمي", 85.62),
(30,"وليد طارق",'2009-08-10', 'M','2026-01-09', "waleed@std.com","1", "علمي", 73.70);

-- *****************************************************************************************
--  إدخال معلومات 6 مواد

INSERT INTO SecondaryـEducationـExcellence.Subjects(Subject_ID,Subject_Name) 
VALUES(501, 'علوم الحاسب'),
(502, 'الرياضيات'),
(503, 'اللغة الإنجليزية'),
(504, 'الفيزياء'),
(505, 'البيانات الضخمة'),
(506, 'الأمن السيبراني');

-- *****************************************************************************************

-- إدخال معلومات 10 معلمين
INSERT INTO SecondaryـEducationـExcellence.Teachers(Teacher_ID ,Teacher_Name,Birth_Date,Gender, Email,Office_Number) 
VALUES(101, 'أحمد المنصور', '1980-05-12', 'M', 'ahmed@school.com', 'B-12'),
(102, 'سارة الشهري', '1985-08-22', 'F', 'sara@school.com', 'A-05'),
(103, 'خالد العتيبي', '1978-03-15', 'M', 'khaled@school.com', 'C-01'),
(104, 'نورة القحطاني', '1990-11-30', 'F', 'noura@school.com', 'A-09'),
(105, 'محمد الزهراني', '1982-07-19', 'M', 'mohammed@school.com', 'B-03'),
(106, 'فاطمة الدوسري', '1988-01-25', 'F', 'fatima@school.com', 'D-10'),
(107, 'عبدالعزيز الغامدي', '1975-12-05', 'M', 'aziz@school.com', 'C-04'),
(108, 'هند البقمي', '1992-06-14', 'F', 'hind@school.com', 'A-02'),
(109, 'فيصل الشمري', '1984-09-09', 'M', 'faisal@school.com', 'B-15'),
(110, 'ريم الحربي', '1987-04-20', 'F', 'reem@school.com', 'D-02');


SELECT * FROM Students;

